#元组
#和list最大区别,不能被修改
#不同类型,有序,支持切片,索引
#元组名称 = (元素,元素,元素)
from functools import total_ordering

# t1 = (1,2,3,4)
# #读音:他po
# #方法
# #s.count() 总计次数
# #s.index()第一次位置
# print(type(t1))
# print(t1[-1])
# t2 = t1[0:5]
# print(t2)
# #元组存储单个元素时,需要:
# t3 = tuple(100)
# #不能使用:
# t4 = (100)
#可重复,有序,不可修改

#组包与解包

#组包:其实结束创立一个元组
#基础解包
# a,b,c,d = t1# t1 = (1.2.3,4)
# #即a= 1 b= 2 c= 3 d= 4
#
# #*:收集剩余所有元素,将其生成列表
# x,*y,z = t2
#即:x = 1  *y = [2,3]  z = 4

#交换两个元素,
#a,b = b, a
#相当于先组包然后解包
#c,a,b = a,b,c

# (学号, 成绩1, 成绩2, 成绩3)
#嵌套元组
students = [
    ("S001", 85, 92, 78),
    ("S002", 92, 88, 95),
    ("S003", 78, 85, 82),
    ("S004", 88, 79, 91),
    ("S005", 95, 96, 89),
    ("S006", 76, 82, 77),
    ("S007", 89, 91, 94),
    ("S008", 75, 69, 82),
    ("S009", 86, 89, 98),
    ("S010", 66, 59, 72),
]
#shift+tab:删除缩进
#计算每个学生的总分和平均分,然后输出
for s in students:
    total = (s[1] + s[2] + s[3])
    avg = total / 3
    print(f"学生{s[0]}的总分为{total},平均分为{avg:.1f}")
    if avg > 90:
        print(f"学生{s[0]}平均分为{avg:.1f},竟然超过了90分,真是太棒啦")
#统计各科成绩的最高分,最低分,平均分输出
max = 0
min = 100
avg = 0
for s in students:
    if s[1] > max:
        max = s[1]
    if s[1] < min:
        min = s[1]
    avg +=s[1]

#输出平均分大于90分的学生的学号
